[
  {
    "title": "Java Full Stack Developer",
    "company": "Assurant",
    "location": "USA",
    "period": "Jan 2024 - Present",
    "description": [
      "Collaborated with 4 cross-functional teams on a banking initiative and mentored a team of 5 interns, ensuring on-time feature delivery through Agile practices like Scrum",
      "Built and launched 3 responsive portals using Spring MVC, HTML, CSS, ReactJS, Angular, and Svelte to deliver dynamic, user-friendly front-end experiences",
      "Developed RESTful APIs with Java 8 and Spring Boot to support real-time data operations, integrating Hibernate with both SQL and NoSQL (MongoDB) databases",
      "Maintained 8 microservice codebases using Git and Bitbucket, implemented Apache Camel for routing, and deployed services on OpenShift and JBoss",
      "Configured Tomcat servers and Jenkins CI/CD pipelines across 6 projects, reducing deployment time by 25%, while incorporating Splunk for monitoring and building AWS Lambda-based serverless microservices with S3 and CloudWatch",
      "Performed functional validation for 50 APIs using Postman and enhanced testing with JUnit automation, boosting bug detection efficiency by 90%"
    ],
    "current": true
  },
  {
    "title": "Software Engineer",
    "company": "Quinbay",
    "location": "",
    "period": "Jan 2022 - July 2023",
    "description": [
      "Worked on scalable web pages for warehouse management based on Figma specifications using ReactJS, implementing backend microservice changes with Spring Boot, adhering to Agile/SDLC methodologies for requirement analysis, development, testing, and release cycles.",
      "Spearheaded the migration of Stockholm’s inbound frontend codebase from AngularJS to Vue.js, delivering a complete overhaul that improved functionality and performance.",
      "Integrated Tailwind and Bootstrap 3 CSS frameworks to develop responsive, visually appealing web pages, while building reusable CSS utility components using Blibli’s internal libraries.",
      "Authored comprehensive unit tests using Jest, which ensured code quality and boosted code reliability and maintainability. Wrote integration test cases with Playwright, enhancing end-to-end testing coverage and minimizing production bugs.",
      "Optimized code quality by reducing application error rates from 2.5% to 0.5% through continuous refinement and proactive issue resolution.",
      "Facilitated code reviews and mentored new UI interns, fostering adherence to best practices and ensuring high-quality deliverables.",
      "Demonstrated a Proof of Concept (POC) for warehouse layouts using the fabricJS library, showcasing innovative approaches to warehouse design.",
      "Conducted Root Cause Analysis (RCA) for various critical issues, achieving an average resolution time of approximately 2 hours and demonstrating strong proactive problem-solving skills.",
      "Significantly improved code quality, reducing application error rates from 2.5% to 0.5% through continuous refinement.",
      "Conducted thorough code reviews and mentored new interns to foster adherence to best practices."
    ]
  },
  {
    "title": "Software Developer Intern",
    "company": "APSSDC",
    "location": "",
    "period": "June 2021 - Aug 2021",
    "description": [
      "Gained proficiency in the Django framework, focusing on the integration between frontend and backend applications.",
      "Developed a secure online voting application using the Django framework, allowing users to vote for specific candidates. Utilized MySQL for efficient data storage and management, ensuring a seamless user experience."
    ]
  }
]
