[
  {
    "title": "Full Stack Developer",
    "company": "Assurant",
    "location": "USA",
    "period": "Jan 2024 - Current",
    "description": [
      "Worked with 4 teams on a banking project; mentored 2 interns; ensured timely delivery using Agile/Scrum.",
      "Developed 3 responsive portals using Spring MVC, ReactJS, HTML and CSS for dynamic UIs.",
      "Built REST APIs with Java 21, Spring Boot, Hibernate; integrated SQL and MongoDB.",
      "Managed 8 microservices with Bitbucket; used Kafka, Docker, and Kubernetes for deployment.",
      "Set up Tomcat, Jenkins (6 projects), AWS Lambda, S3, CloudWatch, and Grafana for CI/CD and monitoring.",
      "Validated 30+ APIs via Postman and JUnit, improving bug detection by 90%."
    ],
    "current": true
  },
  {
    "title": "Software Engineer",
    "company": "Quinbay",
    "location": "India",
    "period": "Jan 2022 - Aug 2023",
    "description": [
      "Built 15+ scalable warehouse pages with ReactJS/Spring Boot using Agile and Jenkins to speed delivery.",
      "Migrated 35+ components from AngularJS to Vue.js, improving load time by 40% and cutting maintenance 25%.",
      "Created responsive UIs with Tailwind/Bootstrap and 20+ reusable components for UI consistency.",
      "Wrote unit tests with Jest, reducing defects by 35% and speeding feedback via CI integration.",
      "Built REST APIs for inventory and shipment tracking, improving data consistency and API speed by 35%.",
      "Used Playwright for integration tests, reaching 96% coverage and minimizing prod bugs.",
      "Cut error rates from 2.5% to 0.5% through code optimization and proactive fixes.",
      "Led code reviews, mentored UI interns, and promoted best practices for high-quality delivery.",
      "Built POC with fabricJS for dynamic layouts, reducing item search time by 50%."
    ]
  },
  {
    "title": "Software Developer",
    "company": "APSSDC",
    "location": "India",
    "period": "June 2021 - Jan 2022",
    "description": [
      "Built 3 full-stack apps with Django, integrating frontend and backend seamlessly.",
      "Created a secure voting system with authentication, vote validation, and fraud prevention.",
      "Designed a 5-table MySQL schema, boosting query speed by 30% and ensuring data integrity.",
      "Implemented role-based auth with session timeouts in Django to enhance security."
    ]
  }
]
